witalis3/UA3REO-DDC-Transceiver/STM32/Src/settings.c
		LCD_showError("Loaded default settings", true);
		SaveSettings();
		SaveSettingsToEEPROM();
	}
	
	//VFO settings
	if(!TRX.selected_vfo)
	{
		CurrentVFO = &TRX.VFO_A;
		SecondaryVFO = &TRX.VFO_B;
	}
	else
	{
		CurrentVFO = &TRX.VFO_B;
		SecondaryVFO = &TRX.VFO_A;
	}
}

static void LoadSettingsFromEEPROM(void)
{
	EEPROM_PowerUp();
	uint8_t tryes = 0;
	while (tryes < EEPROM_REPEAT_TRYES && !EEPROM_Read_Data((uint8_t *)&TRX, sizeof(TRX), EEPROM_SECTOR_SETTINGS, true, false))
	{
		tryes++;
	}
	if (tryes >= EEPROM_REPEAT_TRYES)
		println("[ERR] Read EEPROM SETTINGS multiple errors");
	EEPROM_PowerDown();
}

void LoadCalibration(bool clear)
{
	EEPROM_PowerUp();
	uint8_t tryes = 0;
	while (tryes < EEPROM_REPEAT_TRYES && !EEPROM_Read_Data((uint8_t *)&CALIBRATE, sizeof(CALIBRATE), EEPROM_SECTOR_CALIBRATION, true, false))
	{
		tryes++;
	}
	if (tryes >= EEPROM_REPEAT_TRYES)
	{
		println("[ERR] Read EEPROM CALIBRATE multiple errors");
		LCD_showError("EEPROM Error", true);
	}

	if (CALIBRATE.ENDBit != 100 || CALIBRATE.flash_id != CALIB_VERSION || clear || CALIBRATE.csum != calculateCSUM_EEPROM()) // code for checking the firmware in the eeprom, if it does not match, we use the default
	{
		println("[ERR] CALIBRATE Flash check CODE:", CALIBRATE.flash_id, false);
		CALIBRATE.flash_id = CALIB_VERSION; // code for checking the firmware in the eeprom, if it does not match, we use the default
		
		CALIBRATE.ENCODER_INVERT = false;	   // invert left-right rotation of the main encoder
		CALIBRATE.ENCODER2_INVERT = false;	   // invert left-right rotation of the optional encoder
		CALIBRATE.ENCODER_DEBOUNCE = 0;		   // time to eliminate contact bounce at the main encoder, ms
		CALIBRATE.ENCODER2_DEBOUNCE = 50;	   // time to eliminate contact bounce at the additional encoder, ms
		CALIBRATE.ENCODER_SLOW_RATE = 25;	   // slow down the encoder for high resolutions
		CALIBRATE.ENCODER_ON_FALLING = false;  // encoder only triggers when level A falls
		CALIBRATE.ENCODER_ACCELERATION = 75;   //acceleration rate if rotate
		CALIBRATE.TangentType = TANGENT_MH48;		//Tangent type
		CALIBRATE.RF_unit_type = RF_UNIT_QRP;		//RF-unit type
		CALIBRATE.CICFIR_GAINER_48K_val = 54;  // Offset from the output of the CIC compensator
		CALIBRATE.CICFIR_GAINER_96K_val = 48;  // Offset from the output of the CIC compensator
		CALIBRATE.CICFIR_GAINER_192K_val = 42; // Offset from the output of the CIC compensator
		CALIBRATE.CICFIR_GAINER_384K_val = 36; // Offset from the output of the CIC compensator
		CALIBRATE.TXCICFIR_GAINER_val = 42;	   // Offset from the TX-CIC output of the compensator
		CALIBRATE.DAC_GAINER_val = 26;		   // DAC shift
		// Calibrate the maximum output power for each band
		CALIBRATE.rf_out_power_2200m = 29;		   //2200m
		CALIBRATE.rf_out_power_160m = 29;		   //160m
		CALIBRATE.rf_out_power_80m = 27;		   //80m
		CALIBRATE.rf_out_power_40m = 26;		   //40m
		CALIBRATE.rf_out_power_30m = 26;		   //30m
		CALIBRATE.rf_out_power_20m = 24;		   //20m
		CALIBRATE.rf_out_power_17m = 24;		   //17m
		CALIBRATE.rf_out_power_15m = 24;		   //15m
		CALIBRATE.rf_out_power_12m = 24;		   //12m
		CALIBRATE.rf_out_power_cb = 24;				//27mhz
		CALIBRATE.rf_out_power_10m = 24;		   //10m
		CALIBRATE.rf_out_power_6m = 13;			   //6m
		CALIBRATE.rf_out_power_2m = 300;		   //2m
		CALIBRATE.smeter_calibration_hf = 0;		   // S-Meter calibration, set when calibrating the transceiver to S9 (ATT, PREAMP off) HF
		CALIBRATE.smeter_calibration_vhf = 0;		   // S-Meter calibration, set when calibrating the transceiver to S9 (ATT, PREAMP off) VHF
		CALIBRATE.adc_offset = 0;				   // Calibrate the offset at the ADC input (DC)
		CALIBRATE.SWR_FWD_Calibration_HF = 11.0f;	   //SWR Transormator rate forward
		CALIBRATE.SWR_REF_Calibration_HF = 11.0f;	   //SWR Transormator rate return
		CALIBRATE.SWR_FWD_Calibration_6M = 10.0f;	   //SWR Transormator rate forward
		CALIBRATE.SWR_REF_Calibration_6M = 10.0f;	   //SWR Transormator rate return
		CALIBRATE.SWR_FWD_Calibration_VHF = 3.6f;	   //SWR Transormator rate forward
		CALIBRATE.SWR_REF_Calibration_VHF = 3.6f;	   //SWR Transormator rate return
		CALIBRATE.TUNE_MAX_POWER = 2;			   // Maximum RF power in Tune mode
		CALIBRATE.MAX_RF_POWER = 7;				//Max TRX Power for indication
#if defined(FRONTPANEL_X1)
		CALIBRATE.RFU_HPF_START = 60000 * 1000;		   //HPF
		CALIBRATE.RFU_BPF_1_START = 1500 * 1000;	   //160m
		CALIBRATE.RFU_BPF_1_END = 2400 * 1000;		   //160m
		CALIBRATE.RFU_BPF_2_START = 2400 * 1000;	   //80m
		CALIBRATE.RFU_BPF_2_END = 4500 * 1000;		   //80m
		CALIBRATE.RFU_BPF_3_START = 4500 * 1000;	   //40m
		CALIBRATE.RFU_BPF_3_END = 7500 * 1000;		   //40m
		CALIBRATE.RFU_BPF_4_START = 7500 * 1000;	   //30m
		CALIBRATE.RFU_BPF_4_END = 11500 * 1000;		   //30m
		CALIBRATE.RFU_BPF_5_START = 11500 * 1000;	   //20m
		CALIBRATE.RFU_BPF_5_END = 14800 * 1000;		   //20m
		CALIBRATE.RFU_BPF_6_START = 14800 * 1000;	   //17,15m
		CALIBRATE.RFU_BPF_6_END = 22000 * 1000;		   //17,15m
		CALIBRATE.RFU_BPF_7_START = 22000 * 1000;	   //12,10m
		CALIBRATE.RFU_BPF_7_END = 32000 * 1000;		   //12,10m
		CALIBRATE.RFU_BPF_8_START = 135000 * 1000;	   //2m
		CALIBRATE.RFU_BPF_8_END = 150000 * 1000;		   //2m
#elif defined(FRONTPANEL_WF_100D)
		CALIBRATE.RF_unit_type = RF_UNIT_WF_100D;
		CALIBRATE.rf_out_power_2200m = 40;		   //2200m
		CALIBRATE.rf_out_power_160m = 40;		   //160m
		CALIBRATE.rf_out_power_80m = 40;		   //80m
		CALIBRATE.rf_out_power_40m = 40;		   //40m
		CALIBRATE.rf_out_power_30m = 40;		   //30m
		CALIBRATE.rf_out_power_20m = 40;		   //20m
		CALIBRATE.rf_out_power_17m = 40;		   //17m
		CALIBRATE.rf_out_power_15m = 40;		   //15m
		CALIBRATE.rf_out_power_12m = 40;		   //12m
		CALIBRATE.rf_out_power_cb = 40;				//27mhz
		CALIBRATE.rf_out_power_10m = 40;		   //10m
		CALIBRATE.rf_out_power_6m = 40;			   //6m
		CALIBRATE.rf_out_power_2m = 50;		   //2m
		CALIBRATE.RFU_LPF_END = 53 * 1000 * 1000;		   //LPF
		CALIBRATE.RFU_HPF_START = 60 * 1000 * 1000;		   //HPF
		CALIBRATE.RFU_BPF_0_START = 1600 * 1000;	   //1.6-2.5mH
		CALIBRATE.RFU_BPF_0_END = 2500 * 1000;		   //
		CALIBRATE.RFU_BPF_1_START = 2500 * 1000;	   //2.5-4mHz
		CALIBRATE.RFU_BPF_1_END = 4000 * 1000;		   //
		CALIBRATE.RFU_BPF_2_START = 6000 * 1000;	   //6-7.3mHz
		CALIBRATE.RFU_BPF_2_END = 7300 * 1000;		   //
		CALIBRATE.RFU_BPF_3_START = 7300 * 1000;	   //7-12mHz
		CALIBRATE.RFU_BPF_3_END = 12000 * 1000;		   //
		CALIBRATE.RFU_BPF_4_START = 12000 * 1000;	   //12-14.5mHz
		CALIBRATE.RFU_BPF_4_END = 14500 * 1000;		   //
		CALIBRATE.RFU_BPF_5_START = 14500 * 1000;	   //14.5-21.5mHz
		CALIBRATE.RFU_BPF_5_END = 21500 * 1000;		   //
		CALIBRATE.RFU_BPF_6_START = 21500 * 1000;	   //21.5-30 mHz
		CALIBRATE.RFU_BPF_6_END = 30000 * 1000;		   //
		CALIBRATE.RFU_BPF_7_START = 135 * 1000 * 1000;	   //135-150mHz
		CALIBRATE.RFU_BPF_7_END = 150 * 1000 * 1000;		   //
		CALIBRATE.RFU_BPF_8_START = 0;	   //disabled
		CALIBRATE.RFU_BPF_8_END = 0;		   //disabled
		CALIBRATE.SWR_FWD_Calibration_HF = 22.0f;	   //SWR Transormator rate forward
		CALIBRATE.SWR_REF_Calibration_HF = 22.0f;	   //SWR Transormator rate return
		CALIBRATE.SWR_FWD_Calibration_6M = 22.0f;	   //SWR Transormator rate forward
		CALIBRATE.SWR_REF_Calibration_6M = 22.0f;	   //SWR Transormator rate return
		CALIBRATE.SWR_FWD_Calibration_VHF = 22.0f;	   //SWR Transormator rate forward
		CALIBRATE.SWR_REF_Calibration_VHF = 22.0f;	   //SWR Transormator rate return
		CALIBRATE.TUNE_MAX_POWER = 10;			   // Maximum RF power in Tune mode
		CALIBRATE.MAX_RF_POWER = 100;				//Max TRX Power for indication
#else
		CALIBRATE.RFU_LPF_END = 60000 * 1000;		   //LPF
		CALIBRATE.RFU_HPF_START = 60000 * 1000;		   //HPF U14-RF1
		CALIBRATE.RFU_BPF_0_START = 135 * 1000 * 1000; //2m U14-RF3
		CALIBRATE.RFU_BPF_0_END = 150 * 1000 * 1000;   //2m
		CALIBRATE.RFU_BPF_1_START = 1500 * 1000;	   //160m U16-RF2
		CALIBRATE.RFU_BPF_1_END = 2400 * 1000;		   //160m
		CALIBRATE.RFU_BPF_2_START = 2400 * 1000;	   //80m U16-RF4
		CALIBRATE.RFU_BPF_2_END = 4700 * 1000;		   //80m
		CALIBRATE.RFU_BPF_3_START = 4700 * 1000;	   //40m U16-RF1
		CALIBRATE.RFU_BPF_3_END = 7200 * 1000;		   //40m
		CALIBRATE.RFU_BPF_4_START = 7200 * 1000;	   //30m U16-RF3
		CALIBRATE.RFU_BPF_4_END = 11500 * 1000;		   //30m
		CALIBRATE.RFU_BPF_5_START = 11500 * 1000;	   //20,17m U14-RF2
		CALIBRATE.RFU_BPF_5_END = 21000 * 1000;		   //20,17m
		CALIBRATE.RFU_BPF_6_START = 21000 * 1000;	   //15,12,10,6m U14-RF4
		CALIBRATE.RFU_BPF_6_END = 64000 * 1000;		   //15,12,10,6m
		CALIBRATE.RFU_BPF_7_START = 0;	   //disabled on qrp version
		CALIBRATE.RFU_BPF_7_END = 0;		   //disabled on qrp version
		CALIBRATE.RFU_BPF_8_START = 0;	   //disabled on qrp version
		CALIBRATE.RFU_BPF_8_END = 0;		   //disabled on qrp version
#endif
		CALIBRATE.VCXO_correction = 0;			   //VCXO Frequency offset
		CALIBRATE.FW_AD8307_SLP = 25.5f;		   //Slope for the log amp used to mreasure the FW power (mV/dB)
		CALIBRATE.FW_AD8307_OFFS = 1150.0f;		   //Offset to back calculate the output voltage to dBm (mV)
		CALIBRATE.BW_AD8307_SLP = 25.5f;		   //Slope for the log amp used to mreasure the BW power (mV/dB)
		CALIBRATE.BW_AD8307_OFFS = 1150.0f;		   //Offset to back calculate the output voltage to dBm (mV)
		CALIBRATE.FAN_MEDIUM_START = 50;		   // Temperature at which the fan starts at half power
		CALIBRATE.FAN_MEDIUM_STOP = 40;			   // Temperature at which the fan stops
		CALIBRATE.FAN_FULL_START = 70;			   // Temperature at which the fan starts at full power
		CALIBRATE.TRX_MAX_RF_TEMP = 80;			   // Maximum RF unit themperature to enable protect
		CALIBRATE.TRX_MAX_SWR = 3;				   // Maximum SWR to enable protect on TX (NOT IN TUNE MODE!)
		CALIBRATE.FM_DEVIATION_SCALE = 4;		   // FM Deviation scale
		CALIBRATE.SSB_POWER_ADDITION = 0;			// Additional power in SSB mode
		CALIBRATE.AM_MODULATION_INDEX = 50;	 //AM Modulation Index
		CALIBRATE.RTC_Coarse_Calibration = 127;	   //Coarse RTC calibration
		CALIBRATE.RTC_Calibration = 0;			   //Real Time Clock calibration
		CALIBRATE.EXT_2200m = 0;						//External port by band
		CALIBRATE.EXT_160m = 1;						//External port by band
		CALIBRATE.EXT_80m = 2;						//External port by band
		CALIBRATE.EXT_60m = 3;						//External port by band
		CALIBRATE.EXT_40m = 4;						//External port by band
		CALIBRATE.EXT_30m = 5;						//External port by band
		CALIBRATE.EXT_20m = 6;						//External port by band
		CALIBRATE.EXT_17m = 7;						//External port by band
		CALIBRATE.EXT_15m = 8;						//External port by band
		CALIBRATE.EXT_12m = 9;						//External port by band
		CALIBRATE.EXT_CB = 10;						//External port by band
		CALIBRATE.EXT_10m = 11;						//External port by band
		CALIBRATE.EXT_6m = 12;						//External port by band
		CALIBRATE.EXT_FM = 13;						//External port by band
		CALIBRATE.EXT_2m = 14;						//External port by band
		CALIBRATE.EXT_70cm = 15;						//External port by band
		CALIBRATE.NOTX_NOTHAM = true;			//disable TX on non-HAM bands
		CALIBRATE.NOTX_2200m = false;			//disable TX on some bands
		CALIBRATE.NOTX_160m = false;
		CALIBRATE.NOTX_80m = false;
		CALIBRATE.NOTX_60m = true;
		CALIBRATE.NOTX_40m = false;
		CALIBRATE.NOTX_30m = false;
		CALIBRATE.NOTX_20m = false;
		CALIBRATE.NOTX_17m = false;
		CALIBRATE.NOTX_15m = false;
		CALIBRATE.NOTX_12m = false;
		CALIBRATE.NOTX_CB = false;
		CALIBRATE.NOTX_10m = false;
		CALIBRATE.NOTX_6m = false;
		CALIBRATE.NOTX_2m = false;
		CALIBRATE.NOTX_70cm = true;
		CALIBRATE.ENABLE_60m_band = false; 	//enable hidden bands
		CALIBRATE.ENABLE_marine_band = false;
		CALIBRATE.OTA_update = true;				//enable OTA FW update over WiFi
		CALIBRATE.TX_StartDelay = 5;			//Relay switch delay before RF signal ON, ms
		CALIBRATE.LCD_Rotate = false;			//LCD 180 degree rotation
		CALIBRATE.PWR_VLT_Calibration = 1000.0f;	//VLT meter calibration

		//Default memory channels
		for (uint8_t i = 0; i < MEMORY_CHANNELS_COUNT; i++)
		{
			CALIBRATE.MEMORY_CHANNELS[i].Freq = 0;
			CALIBRATE.MEMORY_CHANNELS[i].Mode = (uint8_t)getModeFromFreq(CALIBRATE.MEMORY_CHANNELS[i].Freq);
			CALIBRATE.MEMORY_CHANNELS[i].LNA = TRX.LNA;
			CALIBRATE.MEMORY_CHANNELS[i].ATT = TRX.ATT;
			CALIBRATE.MEMORY_CHANNELS[i].ATT_DB = TRX.ATT_DB;
			CALIBRATE.MEMORY_CHANNELS[i].ANT = TRX.ANT;
			CALIBRATE.MEMORY_CHANNELS[i].ADC_Driver = TRX.ADC_Driver;
			CALIBRATE.MEMORY_CHANNELS[i].SQL = false;
			CALIBRATE.MEMORY_CHANNELS[i].FM_SQL_threshold_dbm = TRX.VFO_A.FM_SQL_threshold_dbm;
			CALIBRATE.MEMORY_CHANNELS[i].ADC_PGA = TRX.ADC_PGA;
			CALIBRATE.MEMORY_CHANNELS[i].DNR_Type = 0;
			CALIBRATE.MEMORY_CHANNELS[i].AGC = true;
			CALIBRATE.MEMORY_CHANNELS[i].SAMPLERATE = TRX.SAMPLERATE_MAIN;
		}

		CALIBRATE.ENDBit = 100; // Bit for the end of a successful write to eeprom
		
#ifdef LAY_160x128
		LCD_showError("Load default calibrate", true);
#else
		LCD_showError("Loaded default calibrations", true);
#endif
		SaveCalibration();
	}
	EEPROM_PowerDown();
	//enable bands
	BANDS[BANDID_60m].selectable = CALIBRATE.ENABLE_60m_band;
	BANDS[BANDID_Marine].selectable = CALIBRATE.ENABLE_marine_band;
}

void SaveSettings(void)
{
	BKPSRAM_Enable();
	TRX.csum = calculateCSUM();
	Aligned_CleanDCache_by_Addr((uint32_t *)&TRX, sizeof(TRX));
	if (settings_bank == 1)
	{
		dma_memcpy(BACKUP_SRAM_BANK1_ADDR, &TRX, sizeof(TRX));
		Aligned_CleanDCache_by_Addr(BACKUP_SRAM_BANK1_ADDR, sizeof(TRX));
		dma_memset(BACKUP_SRAM_BANK2_ADDR, 0x00, sizeof(TRX));
		Aligned_CleanDCache_by_Addr(BACKUP_SRAM_BANK2_ADDR, sizeof(TRX));
	}
	else
	{
		dma_memcpy(BACKUP_SRAM_BANK2_ADDR, &TRX, sizeof(TRX));
		Aligned_CleanDCache_by_Addr(BACKUP_SRAM_BANK2_ADDR, sizeof(TRX));
		dma_memset(BACKUP_SRAM_BANK1_ADDR, 0x00, sizeof(TRX));
		Aligned_CleanDCache_by_Addr(BACKUP_SRAM_BANK1_ADDR, sizeof(TRX));
	}
	BKPSRAM_Disable();
	NeedSaveSettings = false;
	//sendToDebug_str("[OK] Settings Saved to bank ");
	//sendToDebug_uint8(settings_bank, false);
	//sendToDebug_uint32(sizeof(TRX), false);
	if (settings_bank == 1)
		settings_bank = 2;
	else
		settings_bank = 1;
}

