witalis3/UA3REO-DDC-Transceiver/STM32/Src/settings.c
void SaveSettingsToEEPROM(void)
{
	if (EEPROM_Busy)
		return;
	EEPROM_PowerUp();
	EEPROM_Busy = true;
	TRX.csum = calculateCSUM();
	uint8_t tryes = 0;
	while (tryes < EEPROM_REPEAT_TRYES && !EEPROM_Sector_Erase(EEPROM_SECTOR_SETTINGS, false))
	{
		println("[ERR] Erase EEPROM Settings error");
		print_flush();
		tryes++;
	}
	if (tryes >= EEPROM_REPEAT_TRYES)
	{
		println("[ERR] Erase EEPROM Settings multiple errors");
		print_flush();
		LCD_showError("EEPROM Error", true);
		EEPROM_Busy = false;
		return;
	}
	tryes = 0;
	while (tryes < EEPROM_REPEAT_TRYES && !EEPROM_Write_Data((uint8_t *)&TRX, sizeof(TRX), EEPROM_SECTOR_SETTINGS, true, false))
	{
		println("[ERR] Write EEPROM Settings error");
		print_flush();
		EEPROM_Sector_Erase(EEPROM_SECTOR_SETTINGS, false);
		tryes++;
	}
	if (tryes >= EEPROM_REPEAT_TRYES)
	{
		println("[ERR] Write EEPROM Settings multiple errors");
		print_flush();
		LCD_showError("EEPROM Error", true);
		EEPROM_Busy = false;
		return;
	}

	EEPROM_Busy = false;
	EEPROM_PowerDown();
	println("[OK] EEPROM Settings Saved");
	print_flush();
}

void SaveCalibration(void)
{
	if (EEPROM_Busy)
		return;
	EEPROM_PowerUp();
	EEPROM_Busy = true;

	CALIBRATE.csum = calculateCSUM_EEPROM();
	uint8_t tryes = 0;
	while (tryes < EEPROM_REPEAT_TRYES && !EEPROM_Sector_Erase(EEPROM_SECTOR_CALIBRATION, false))
	{
		println("[ERR] Erase EEPROM calibrate error");
		print_flush();
		tryes++;
	}
	if (tryes >= EEPROM_REPEAT_TRYES)
	{
		println("[ERR] Erase EEPROM calibrate multiple errors");
		print_flush();
		LCD_showError("EEPROM Error", true);
		EEPROM_Busy = false;
		return;
	}
	tryes = 0;
	while (tryes < EEPROM_REPEAT_TRYES && !EEPROM_Write_Data((uint8_t *)&CALIBRATE, sizeof(CALIBRATE), EEPROM_SECTOR_CALIBRATION, true, false))
	{
		println("[ERR] Write EEPROM calibrate error");
		print_flush();
		EEPROM_Sector_Erase(EEPROM_SECTOR_CALIBRATION, false);
		tryes++;
	}
	if (tryes >= EEPROM_REPEAT_TRYES)
	{
		println("[ERR] Write EEPROM calibrate multiple errors");
		print_flush();
		LCD_showError("EEPROM Error", true);
		EEPROM_Busy = false;
		return;
	}

	EEPROM_Busy = false;
	EEPROM_PowerDown();
	println("[OK] EEPROM Calibrations Saved");
	print_flush();
	NeedSaveCalibration = false;
}

static bool EEPROM_Sector_Erase(uint8_t sector, bool force)
{
	if (!force && !EEPROM_Enabled)
		return true;
	if (!force && SPI_process)
		return false;
	else
		SPI_process = true;

	uint32_t BigAddress = sector * W25Q16_SECTOR_SIZE;
	Address[2] = (BigAddress >> 16) & 0xFF;
	Address[1] = (BigAddress >> 8) & 0xFF;
	Address[0] = BigAddress & 0xFF;

	SPI_Transmit(&Write_Enable, NULL, 1, W25Q16_CS_GPIO_Port, W25Q16_CS_Pin, false, SPI_EEPROM_PRESCALER, false); // Write Enable Command
	SPI_Transmit(&Sector_Erase, NULL, 1, W25Q16_CS_GPIO_Port, W25Q16_CS_Pin, true, SPI_EEPROM_PRESCALER, false);  // Erase Command
	SPI_Transmit(Address, NULL, 3, W25Q16_CS_GPIO_Port, W25Q16_CS_Pin, false, SPI_EEPROM_PRESCALER, false);		  // Write Address ( The first address of flash module is 0x00000000 )
	EEPROM_WaitWrite();

	SPI_process = false;
	return true;
}

static bool EEPROM_Write_Data(uint8_t *Buffer, uint16_t size, uint8_t sector, bool verify, bool force)
{
	if (!force && !EEPROM_Enabled)
		return true;
	if (!force && SPI_process)
		return false;
	else
		SPI_process = true;
	if (size > sizeof(write_clone))
	{
		println("EEPROM buffer error");
		return false;
	}
	dma_memcpy(write_clone, Buffer, size);
	Aligned_CleanDCache_by_Addr((uint32_t *)write_clone, sizeof(write_clone));

	const uint16_t page_size = 256;
	for (uint16_t page = 0; page <= (size / page_size); page++)
	{
		uint32_t BigAddress = page * page_size + (sector * W25Q16_SECTOR_SIZE);
		Address[2] = (BigAddress >> 16) & 0xFF;
		Address[1] = (BigAddress >> 8) & 0xFF;
		Address[0] = BigAddress & 0xFF;
		uint16_t bsize = size - page_size * page;
		if (bsize > page_size)
			bsize = page_size;
		SPI_Transmit(&Write_Enable, NULL, 1, W25Q16_CS_GPIO_Port, W25Q16_CS_Pin, false, SPI_EEPROM_PRESCALER, true);								   // Write Enable Command
		SPI_Transmit(&Page_Program, NULL, 1, W25Q16_CS_GPIO_Port, W25Q16_CS_Pin, true, SPI_EEPROM_PRESCALER, true);									   // Write Command
		SPI_Transmit(Address, NULL, 3, W25Q16_CS_GPIO_Port, W25Q16_CS_Pin, true, SPI_EEPROM_PRESCALER, true);										   // Write Address ( The first address of flash module is 0x00000000 )
		SPI_Transmit((uint8_t *)(write_clone + page_size * page), NULL, bsize, W25Q16_CS_GPIO_Port, W25Q16_CS_Pin, false, SPI_EEPROM_PRESCALER, true); // Write Data
		EEPROM_WaitWrite();
	}

	//verify
	if (verify)
	{
		int16_t last_verified_err = -2;
		int16_t prev_verified_err = -1;
		bool verify_succ = true;
		uint16_t verify_tryes = 0;
		while (last_verified_err != prev_verified_err && verify_tryes < 5)
		{
			verify_succ = true;
			EEPROM_Read_Data(verify_clone, size, sector, false, true);
			for (uint16_t i = 0; i < size; i++)
				if (verify_clone[i] != write_clone[i])
				{
					verify_tryes++;
					prev_verified_err = last_verified_err;
					last_verified_err = i;
					println("EEROM Verify error, pos:", i, " mem:", write_clone[i], " fla:", verify_clone[i]);
					print_flush();
					verify_succ = false;
					break;
				}
			if (verify_succ)
				break;
		}
		if (!verify_succ)
		{
			SPI_process = false;
			return false;
		}
	}
	SPI_process = false;
	return true;
}

static bool EEPROM_Read_Data(uint8_t *Buffer, uint16_t size, uint8_t sector, bool verify, bool force)
{
	if (!force && !EEPROM_Enabled)
		return true;
	if (!force && SPI_process)
		return false;
	else
		SPI_process = true;

	Aligned_CleanDCache_by_Addr((uint32_t *)Buffer, size);

	uint32_t BigAddress = sector * W25Q16_SECTOR_SIZE;
	Address[2] = (BigAddress >> 16) & 0xFF;
	Address[1] = (BigAddress >> 8) & 0xFF;
	Address[0] = BigAddress & 0xFF;

	bool read_ok = false;
	int8_t tryes = 0;
	while (!read_ok && tryes < 5)
	{
		bool res = SPI_Transmit(&Read_Data, NULL, 1, W25Q16_CS_GPIO_Port, W25Q16_CS_Pin, true, SPI_EEPROM_PRESCALER, false); // Read Command
		if (!res)
		{
			EEPROM_Enabled = false;
			println("[ERR] EEPROM not found...");
			LCD_showError("EEPROM init error", true);
			SPI_process = false;
			return true;
		}

		SPI_Transmit(Address, NULL, 3, W25Q16_CS_GPIO_Port, W25Q16_CS_Pin, true, SPI_EEPROM_PRESCALER, false);							 // Write Address
		read_ok = SPI_Transmit(NULL, (uint8_t *)(Buffer), size, W25Q16_CS_GPIO_Port, W25Q16_CS_Pin, false, SPI_EEPROM_PRESCALER, false); // Read
		tryes++;
	}

	Aligned_CleanInvalidateDCache_by_Addr((uint32_t *)Buffer, size);

	//verify
	if (verify)
	{
		Aligned_CleanDCache_by_Addr((uint32_t *)read_clone, size);

